# BuiltInFailures.SteelElementFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SteelElementFailures Class
BuiltInFailures Class Members See Also
---
Failures about steel elements
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class SteelElementFailures
```

Visual Basic
---
```text
Public NotInheritable Class SteelElementFailures
```

Visual C++
---
```text
public ref class SteelElementFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..SteelElementFailures
# See Also
BuiltInFailures..::..SteelElementFailures Members
Autodesk.Revit.DB Namespace